knieriem/tinygo-stm32-svd/svd/stm32h755cm7.svd
        <register>
          <dim>4</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>1-4</dimIndex>
          <name>BTR%s</name>
          <displayName>BTR%s</displayName>
          <description>This register contains the control
          information of each memory bank, used for SRAMs, PSRAM
          and NOR Flash memories.If the EXTMOD bit is set in the
          FMC_BCRx register, then this register is partitioned for
          write and read access, that is, 2 registers are
          available: one to configure read accesses (this register)
          and one to configure write accesses (FMC_BWTRx
          registers).</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>Address setup phase duration These bits
              are written by software to define the duration of the
              address setup phase (refer to Figure81 to Figure93),
              used in SRAMs, ROMs and asynchronous NOR Flash: For
              each access mode address setup phase duration, please
              refer to the respective figure (refer to Figure81 to
              Figure93). Note: In synchronous accesses, this value
              is dont care. In Muxed mode or Mode D, the minimum
              value for ADDSET is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ADDHLD</name>
              <description>Address-hold phase duration These bits
              are written by software to define the duration of the
              address hold phase (refer to Figure81 to Figure93),
              used in mode D or multiplexed accesses: For each
              access mode address-hold phase duration, please refer
              to the respective figure (Figure81 to Figure93).
              Note: In synchronous accesses, this value is not
              used, the address hold phase is always 1 memory clock
              period duration.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>1</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DATAST</name>
              <description>Data-phase duration These bits are
              written by software to define the duration of the
              data phase (refer to Figure81 to Figure93), used in
              asynchronous accesses: For each memory type and
              access mode data-phase duration, please refer to the
              respective figure (Figure81 to Figure93). Example:
              Mode1, write access, DATAST=1: Data-phase duration=
              DATAST+1 = 2 KCK_FMC clock cycles. Note: In
              synchronous accesses, this value is dont
              care.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>1</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BUSTURN</name>
              <description>Bus turnaround phase duration These bits
              are written by software to add a delay at the end of
              a write-to-read or read-to write transaction. The
              programmed bus turnaround delay is inserted between
              an asynchronous read (in muxed or mode D) or write
              transaction and any other asynchronous /synchronous
              read/write from/to a static bank. If a read operation
              is performed, the bank can be the same or a different
              one, whereas it must be different in case of write
              operation to the bank, except in muxed mode or mode
              D. In some cases, whatever the programmed BUSTRUN
              values, the bus turnaround delay is fixed as follows:
              The bus turnaround delay is not inserted between two
              consecutive asynchronous write transfers to the same
              static memory bank except in muxed mode and mode D.
              There is a bus turnaround delay of 1 FMC clock cycle
              between: Two consecutive asynchronous read transfers
              to the same static memory bank except for modes muxed
              and D. An asynchronous read to an asynchronous or
              synchronous write to any static bank or dynamic bank
              except in modes muxed and D mode. There is a bus
              turnaround delay of 2 FMC clock cycle between: Two
              consecutive synchronous write operations (in Burst or
              Single mode) to the same bank. A synchronous write
              (burst or single) access and an asynchronous write or
              read transfer to or from static memory bank (the bank
              can be the same or a different one in case of a read
              operation. Two consecutive synchronous read
              operations (in Burst or Single mode) followed by any
              synchronous/asynchronous read or write from/to
              another static memory bank. There is a bus turnaround
              delay of 3 FMC clock cycle between: Two consecutive
              synchronous write operations (in Burst or Single
              mode) to different static banks. A synchronous write
              access (in Burst or Single mode) and a synchronous
              read from the same or a different bank. The bus
              turnaround delay allows to match the minimum time
              between consecutive transactions (tEHEL from NEx high
              to NEx low) and the maximum time required by the
              memory to free the data bus after a read access
              (tEHQZ): (BUSTRUN + 1) KCK_FMC period &amp;#8805;
              tEHELmin and (BUSTRUN + 2)KCK_FMC period &amp;#8805;
              tEHQZmax if EXTMOD = 0 (BUSTRUN + 2)KCK_FMC period
              &amp;#8805; max (tEHELmin, tEHQZmax) if EXTMOD = 126.
              ...</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>Clock divide ratio (for FMC_CLK signal)
              These bits define the period of FMC_CLK clock output
              signal, expressed in number of KCK_FMC cycles: In
              asynchronous NOR Flash, SRAM or PSRAM accesses, this
              value is dont care. Note: Refer to Section20.6.5:
              Synchronous transactions for FMC_CLK divider ratio
              formula)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>1</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DATLAT</name>
              <description>Data latency for synchronous memory For
              synchronous access with read write burst mode enabled
              these bits define the number of memory clock
              cycles</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ACCMOD</name>
              <description>Access mode These bits specify the
              asynchronous access modes as shown in the timing
              diagrams. They are taken into account only when the
              EXTMOD bit in the FMC_BCRx register is
              1.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>ACCMOD</name>
                <enumeratedValue>
                  <name>A</name>
                  <description>Access mode A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>Access mode B</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>Access mode C</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D</name>
                  <description>Access mode D</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>2-4</dimIndex>
          <name>BCR%s</name>
          <displayName>BCR%s</displayName>
          <description>This register contains the control
          information of each memory bank, used for SRAMs, PSRAM
          and NOR Flash memories.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000030D2</resetValue>
          <fields>
            <field derivedFrom="FMC.BCR1.MBKEN">
              <name>MBKEN</name>
              <description>Memory bank enable bit This bit enables
              the memory bank. After reset Bank1 is enabled, all
              others are disabled. Accessing a disabled bank causes
              an ERROR on AXI bus.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="FMC.BCR1.MUXEN">
              <name>MUXEN</name>
              <description>Address/data multiplexing enable bit
              When this bit is set, the address and data values are
              multiplexed on the data bus, valid only with NOR and
              PSRAM memories:</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="FMC.BCR1.MTYP">
              <name>MTYP</name>
              <description>Memory type These bits define the type
              of external memory attached to the corresponding
              memory bank:</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field derivedFrom="FMC.BCR1.MWID">
              <name>MWID</name>
              <description>Memory data bus width Defines the
              external memory device width, valid for all type of
              memories.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field derivedFrom="FMC.BCR1.FACCEN">
              <name>FACCEN</name>
              <description>Flash access enable This bit enables NOR
              Flash memory access operations.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="FMC.BCR1.BURSTEN">
              <name>BURSTEN</name>
              <description>Burst enable bit This bit
              enables/disables synchronous accesses during read
              operations. It is valid only for synchronous memories
              operating in Burst mode:</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="FMC.BCR1.WAITPOL">
              <name>WAITPOL</name>
              <description>Wait signal polarity bit This bit
              defines the polarity of the wait signal from memory
              used for either in synchronous or asynchronous
              mode:</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="FMC.BCR1.WAITCFG">
              <name>WAITCFG</name>
              <description>Wait timing configuration The NWAIT
              signal indicates whether the data from the memory are
              valid or if a wait state must be inserted when
              accessing the memory in synchronous mode. This
              configuration bit determines if NWAIT is asserted by
              the memory one clock cycle before the wait state or
              during the wait state:</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="FMC.BCR1.WREN">
              <name>WREN</name>
              <description>Write enable bit This bit indicates
              whether write operations are enabled/disabled in the
              bank by the FMC:</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="FMC.BCR1.WAITEN">
              <name>WAITEN</name>
              <description>Wait enable bit This bit
              enables/disables wait-state insertion via the NWAIT
              signal when accessing the memory in synchronous
              mode.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="FMC.BCR1.EXTMOD">
              <name>EXTMOD</name>
              <description>Extended mode enable. This bit enables
              the FMC to program the write timings for asynchronous
              accesses inside the FMC_BWTR register, thus resulting
              in different timings for read and write operations.
              Note: When the extended mode is disabled, the FMC can
              operate in Mode1 or Mode2 as follows: ** Mode 1 is
              the default mode when the SRAM/PSRAM memory type is
              selected (MTYP =0x0 or 0x01) ** Mode 2 is the default
              mode when the NOR memory type is selected (MTYP =
              0x10).</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="FMC.BCR1.ASYNCWAIT">
              <name>ASYNCWAIT</name>
              <description>Wait signal during asynchronous
              transfers This bit enables/disables the FMC to use
              the wait signal even during an asynchronous
              protocol.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="FMC.BCR1.CPSIZE">
              <name>CPSIZE</name>
              <description>CRAM Page Size These are used for
              Cellular RAM 1.5 which does not allow burst access to
              cross the address boundaries between pages. When
              these bits are configured, the FMC controller splits
              automatically the burst access when the memory page
              size is reached (refer to memory datasheet for page
              size). Other configuration: reserved.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field derivedFrom="FMC.BCR1.CBURSTRW">
              <name>CBURSTRW</name>
              <description>Write burst enable For PSRAM (CRAM)
              operating in Burst mode, the bit enables synchronous
              accesses during write operations. The enable bit for
              synchronous read accesses is the BURSTEN bit in the
              FMC_BCRx register.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCR</name>
          <displayName>PCR</displayName>
          <description>NAND Flash control registers</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000018</resetValue>
          <fields>
            <field>
              <name>PWAITEN</name>
              <description>Wait feature enable bit. This bit
              enables the Wait feature for the NAND Flash memory
              bank:</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PWAITEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Wait feature disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Wait feature enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PBKEN</name>
              <description>NAND Flash memory bank enable bit. This
              bit enables the memory bank. Accessing a disabled
              memory bank causes an ERROR on AXI bus</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PBKEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Corresponding memory bank is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Corresponding memory bank is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWID</name>
              <description>Data bus width. These bits define the
              external memory device width.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>PWID</name>
                <enumeratedValue>
                  <name>Bits8</name>
                  <description>External memory device width 8 bits</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bits16</name>
                  <description>External memory device width 16 bits</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECCEN</name>
              <description>ECC computation logic enable
              bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ECCEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>ECC logic is disabled and reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>ECC logic is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCLR</name>
              <description>CLE to RE delay. These bits set time
              from CLE low to RE low in number of KCK_FMC clock
              cycles. The time is give by the following formula:
              t_clr = (TCLR + SET + 2) TKCK_FMC where TKCK_FMC is
              the KCK_FMC clock period Note: Set is MEMSET or
              ATTSET according to the addressed
              space.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TAR</name>
              <description>ALE to RE delay. These bits set time
              from ALE low to RE low in number of KCK_FMC clock
              cycles. Time is: t_ar = (TAR + SET + 2) TKCK_FMC
              where TKCK_FMC is the FMC clock period Note: Set is
              MEMSET or ATTSET according to the addressed
              space.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ECCPS</name>
              <description>ECC page size. These bits define the
              page size for the extended ECC:</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>ECCPS</name>
                <enumeratedValue>
                  <name>Bytes256</name>
                  <description>ECC page size 256 bytes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bytes512</name>
                  <description>ECC page size 512 bytes</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bytes1024</name>
                  <description>ECC page size 1024 bytes</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bytes2048</name>
                  <description>ECC page size 2048 bytes</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bytes4096</name>
                  <description>ECC page size 4096 bytes</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bytes8192</name>
                  <description>ECC page size 8192 bytes</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
