knieriem/tinygo-stm32-svd/svd/stm32h755cm7.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="ADC3_Common">
      <name>ADC12_Common</name>
      <baseAddress>0x40022300</baseAddress>
      <interrupt>
        <name>ADC1_2</name>
        <description>ADC1 and ADC2</description>
        <value>18</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>DMAMUX1</name>
      <description>DMAMUX</description>
      <groupName>DMAMUX</groupName>
      <baseAddress>0x40020800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMAMUX1_OV</name>
        <description>DMAMUX1 overrun interrupt</description>
        <value>102</value>
      </interrupt>
      <registers>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-15</dimIndex>
          <name>C%sCR</name>
          <displayName>C%sCR</displayName>
          <description>DMAMux - DMA request line multiplexer
          channel x control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMAREQ_ID</name>
              <description>Input DMA request line
              selected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>DMAREQ_ID</name>
                <enumeratedValue>
                  <name>none</name>
                  <description>No signal selected as request input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux1_req_gen0</name>
                  <description>Signal `dmamux1_req_gen0` selected as request input</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux1_req_gen1</name>
                  <description>Signal `dmamux1_req_gen1` selected as request input</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux1_req_gen2</name>
                  <description>Signal `dmamux1_req_gen2` selected as request input</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux1_req_gen3</name>
                  <description>Signal `dmamux1_req_gen3` selected as request input</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux1_req_gen4</name>
                  <description>Signal `dmamux1_req_gen4` selected as request input</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux1_req_gen5</name>
                  <description>Signal `dmamux1_req_gen5` selected as request input</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux1_req_gen6</name>
                  <description>Signal `dmamux1_req_gen6` selected as request input</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux1_req_gen7</name>
                  <description>Signal `dmamux1_req_gen7` selected as request input</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>adc1_dma</name>
                  <description>Signal `adc1_dma` selected as request input</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>adc2_dma</name>
                  <description>Signal `adc2_dma` selected as request input</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim1_ch1</name>
                  <description>Signal `tim1_ch1` selected as request input</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim1_ch2</name>
                  <description>Signal `tim1_ch2` selected as request input</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim1_ch3</name>
                  <description>Signal `tim1_ch3` selected as request input</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim1_ch4</name>
                  <description>Signal `tim1_ch4` selected as request input</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim1_up</name>
                  <description>Signal `tim1_up` selected as request input</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim1_trig</name>
                  <description>Signal `tim1_trig` selected as request input</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim1_com</name>
                  <description>Signal `tim1_com` selected as request input</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim2_ch1</name>
                  <description>Signal `tim2_ch1` selected as request input</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim2_ch2</name>
                  <description>Signal `tim2_ch2` selected as request input</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim2_ch3</name>
                  <description>Signal `tim2_ch3` selected as request input</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim2_ch4</name>
                  <description>Signal `tim2_ch4` selected as request input</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim2_up</name>
                  <description>Signal `tim2_up` selected as request input</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim3_ch1</name>
                  <description>Signal `tim3_ch1` selected as request input</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim3_ch2</name>
                  <description>Signal `tim3_ch2` selected as request input</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim3_ch3</name>
                  <description>Signal `tim3_ch3` selected as request input</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim3_ch4</name>
                  <description>Signal `tim3_ch4` selected as request input</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim3_up</name>
                  <description>Signal `tim3_up` selected as request input</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim3_trig</name>
                  <description>Signal `tim3_trig` selected as request input</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim4_ch1</name>
                  <description>Signal `tim4_ch1` selected as request input</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim4_ch2</name>
                  <description>Signal `tim4_ch2` selected as request input</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim4_ch3</name>
                  <description>Signal `tim4_ch3` selected as request input</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim4_up</name>
                  <description>Signal `tim4_up` selected as request input</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i2c1_rx_dma</name>
                  <description>Signal `i2c1_rx_dma` selected as request input</description>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i2c1_tx_dma</name>
                  <description>Signal `i2c1_tx_dma` selected as request input</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i2c2_rx_dma</name>
                  <description>Signal `i2c2_rx_dma` selected as request input</description>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i2c2_tx_dma</name>
                  <description>Signal `i2c2_tx_dma` selected as request input</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>spi1_rx_dma</name>
                  <description>Signal `spi1_rx_dma` selected as request input</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>spi1_tx_dma</name>
                  <description>Signal `spi1_tx_dma` selected as request input</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>spi2_rx_dma</name>
                  <description>Signal `spi2_rx_dma` selected as request input</description>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>spi2_tx_dma</name>
                  <description>Signal `spi2_tx_dma` selected as request input</description>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>usart1_rx_dma</name>
                  <description>Signal `usart1_rx_dma` selected as request input</description>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>usart1_tx_dma</name>
                  <description>Signal `usart1_tx_dma` selected as request input</description>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>usart2_rx_dma</name>
                  <description>Signal `usart2_rx_dma` selected as request input</description>
                  <value>43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>usart2_tx_dma</name>
                  <description>Signal `usart2_tx_dma` selected as request input</description>
                  <value>44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>usart3_rx_dma</name>
                  <description>Signal `usart3_rx_dma` selected as request input</description>
                  <value>45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>usart3_tx_dma</name>
                  <description>Signal `usart3_tx_dma` selected as request input</description>
                  <value>46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim8_ch1</name>
                  <description>Signal `tim8_ch1` selected as request input</description>
                  <value>47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim8_ch2</name>
                  <description>Signal `tim8_ch2` selected as request input</description>
                  <value>48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim8_ch3</name>
                  <description>Signal `tim8_ch3` selected as request input</description>
                  <value>49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim8_ch4</name>
                  <description>Signal `tim8_ch4` selected as request input</description>
                  <value>50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim8_up</name>
                  <description>Signal `tim8_up` selected as request input</description>
                  <value>51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim8_trig</name>
                  <description>Signal `tim8_trig` selected as request input</description>
                  <value>52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim8_com</name>
                  <description>Signal `tim8_com` selected as request input</description>
                  <value>53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim5_ch1</name>
                  <description>Signal `tim5_ch1` selected as request input</description>
                  <value>55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim5_ch2</name>
                  <description>Signal `tim5_ch2` selected as request input</description>
                  <value>56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim5_ch3</name>
                  <description>Signal `tim5_ch3` selected as request input</description>
                  <value>57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim5_ch4</name>
                  <description>Signal `tim5_ch4` selected as request input</description>
                  <value>58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim5_up</name>
                  <description>Signal `tim5_up` selected as request input</description>
                  <value>59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim5_trig</name>
                  <description>Signal `tim5_trig` selected as request input</description>
                  <value>60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>spi3_rx_dma</name>
                  <description>Signal `spi3_rx_dma` selected as request input</description>
                  <value>61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>spi3_tx_dma</name>
                  <description>Signal `spi3_tx_dma` selected as request input</description>
                  <value>62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uart4_rx_dma</name>
                  <description>Signal `uart4_rx_dma` selected as request input</description>
                  <value>63</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uart4_tx_dma</name>
                  <description>Signal `uart4_tx_dma` selected as request input</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uart5_rx_dma</name>
                  <description>Signal `uart5_rx_dma` selected as request input</description>
                  <value>65</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uart5_tx_dma</name>
                  <description>Signal `uart5_tx_dma` selected as request input</description>
                  <value>66</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dac_ch1_dma</name>
                  <description>Signal `dac_ch1_dma` selected as request input</description>
                  <value>67</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dac_ch2_dma</name>
                  <description>Signal `dac_ch2_dma` selected as request input</description>
                  <value>68</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim6_up</name>
                  <description>Signal `tim6_up` selected as request input</description>
                  <value>69</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tim7_up</name>
                  <description>Signal `tim7_up` selected as request input</description>
                  <value>70</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>usart6_rx_dma</name>
                  <description>Signal `usart6_rx_dma` selected as request input</description>
                  <value>71</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>usart6_tx_dma</name>
                  <description>Signal `usart6_tx_dma` selected as request input</description>
                  <value>72</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i2c3_rx_dma</name>
                  <description>Signal `i2c3_rx_dma` selected as request input</description>
                  <value>73</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i2c3_tx_dma</name>
                  <description>Signal `i2c3_tx_dma` selected as request input</description>
                  <value>74</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dcmi_dma</name>
                  <description>Signal `dcmi_dma` selected as request input</description>
                  <value>75</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cryp_in_dma</name>
                  <description>Signal `cryp_in_dma` selected as request input</description>
                  <value>76</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cryp_out_dma</name>
                  <description>Signal `cryp_out_dma` selected as request input</description>
                  <value>77</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>hash_in_dma</name>
                  <description>Signal `hash_in_dma` selected as request input</description>
                  <value>78</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uart7_rx_dma</name>
                  <description>Signal `uart7_rx_dma` selected as request input</description>
                  <value>79</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uart7_tx_dma</name>
                  <description>Signal `uart7_tx_dma` selected as request input</description>
                  <value>80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uart8_rx_dma</name>
                  <description>Signal `uart8_rx_dma` selected as request input</description>
                  <value>81</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uart8_tx_dma</name>
                  <description>Signal `uart8_tx_dma` selected as request input</description>
                  <value>82</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>spi4_rx_dma</name>
                  <description>Signal `spi4_rx_dma` selected as request input</description>
                  <value>83</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>spi4_tx_dma</name>
                  <description>Signal `spi4_tx_dma` selected as request input</description>
                  <value>84</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>spi5_rx_dma</name>
                  <description>Signal `spi5_rx_dma` selected as request input</description>
                  <value>85</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>spi5_tx_dma</name>
                  <description>Signal `spi5_tx_dma` selected as request input</description>
                  <value>86</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sai1a_dma</name>
                  <description>Signal `sai1a_dma` selected as request input</description>
                  <value>87</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sai1b_dma</name>
                  <description>Signal `sai1b_dma` selected as request input</description>
                  <value>88</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sai2a_dma</name>
                  <description>Signal `sai2a_dma` selected as request input</description>
                  <value>89</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sai2b_dma</name>
                  <description>Signal `sai2b_dma` selected as request input</description>
                  <value>90</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>swpmi_rx_dma</name>
                  <description>Signal `swpmi_rx_dma` selected as request input</description>
                  <value>91</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>swpmi_tx_dma</name>
                  <description>Signal `swpmi_tx_dma` selected as request input</description>
                  <value>92</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>spdifrx_dat_dma</name>
                  <description>Signal `spdifrx_dat_dma` selected as request input</description>
                  <value>93</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>spdifrx_ctrl_dma</name>
                  <description>Signal `spdifrx_ctrl_dma` selected as request input</description>
                  <value>94</value>
                </enumeratedValue>
