knieriem/tinygo-stm32-svd/svd/stm32h755cm7.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>Ethernet_DMA</name>
      <description>Ethernet DMA</description>
      <baseAddress>0x40029000</baseAddress>
      <registers>
        <register>
          <name>DMAMR</name>
          <description>DMA mode register</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTM</name>
              <description>Interrupt Mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PR</name>
              <description>Priority ratio</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TXPR</name>
              <description>Transmit priority</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DA</name>
              <description>DMA Tx or Rx Arbitration Scheme</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWR</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMASBMR</name>
          <description>System bus mode register</description>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x01010000</resetValue>
          <fields>
            <field>
              <name>RB</name>
              <description>Rebuild INCRx Burst</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB</name>
              <description>Mixed Burst</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AAL</name>
              <description>Address-Aligned Beats</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FB</name>
              <description>Fixed Burst Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAISR</name>
          <description>Interrupt status register</description>
          <addressOffset>0x8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MACIS</name>
              <description>MAC Interrupt Status</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTLIS</name>
              <description>MTL Interrupt Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DC0IS</name>
              <description>DMA Channel Interrupt Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMADSR</name>
          <description>Debug status register</description>
          <addressOffset>0xC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TPS0</name>
              <description>DMA Channel Transmit Process State</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RPS0</name>
              <description>DMA Channel Receive Process State</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AXWHSTS</name>
              <description>AHB Master Write Channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACCR</name>
          <description>Channel control register</description>
          <addressOffset>0x100</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DSL</name>
              <description>Descriptor Skip Length</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PBLX8</name>
              <description>8xPBL mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSS</name>
              <description>Maximum Segment Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTxCR</name>
          <description>Channel transmit control register</description>
          <addressOffset>0x104</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXPBL</name>
              <description>Transmit Programmable Burst Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>TSE</name>
              <description>TCP Segmentation Enabled</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OSF</name>
              <description>Operate on Second Packet</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST</name>
              <description>Start or Stop Transmission Command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACRxCR</name>
          <description>Channel receive control register</description>
          <addressOffset>0x108</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RPF</name>
              <description>DMA Rx Channel Packet Flush</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXPBL</name>
              <description>Receive Programmable Burst Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>RBSZ</name>
              <description>Receive Buffer size</description>
              <bitOffset>1</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
            <field>
              <name>SR</name>
              <description>Start or Stop Receive</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTxDLAR</name>
          <description>Channel Tx descriptor list address register</description>
          <addressOffset>0x114</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TDESLA</name>
              <description>Start of Transmit List</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACRxDLAR</name>
          <description>Channel Rx descriptor list address register</description>
          <addressOffset>0x11C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDESLA</name>
              <description>Start of Receive List</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTxDTPR</name>
          <description>Channel Tx descriptor tail pointer register</description>
          <addressOffset>0x120</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TDT</name>
              <description>Transmit Descriptor Tail Pointer</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACRxDTPR</name>
          <description>Channel Rx descriptor tail pointer register</description>
          <addressOffset>0x128</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDT</name>
              <description>Receive Descriptor Tail Pointer</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTxRLR</name>
          <description>Channel Tx descriptor ring length register</description>
          <addressOffset>0x12C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TDRL</name>
              <description>Transmit Descriptor Ring Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACRxRLR</name>
          <description>Channel Rx descriptor ring length register</description>
          <addressOffset>0x130</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDRL</name>
              <description>Receive Descriptor Ring Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACIER</name>
          <description>Channel interrupt enable register</description>
          <addressOffset>0x134</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NIE</name>
              <description>Normal Interrupt Summary Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AIE</name>
              <description>Abnormal Interrupt Summary Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CDEE</name>
              <description>Context Descriptor Error Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBEE</name>
              <description>Fatal Bus Error Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERIE</name>
              <description>Early Receive Interrupt Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETIE</name>
              <description>Early Transmit Interrupt Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RWTE</name>
              <description>Receive Watchdog Timeout Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSE</name>
              <description>Receive Stopped Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RBUE</name>
              <description>Receive Buffer Unavailable Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RIE</name>
              <description>Receive Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TBUE</name>
              <description>Transmit Buffer Unavailable Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXSE</name>
              <description>Transmit Stopped Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIE</name>
              <description>Transmit Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACRxIWTR</name>
          <description>Channel Rx interrupt watchdog timer register</description>
          <addressOffset>0x138</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RWT</name>
              <description>Receive Interrupt Watchdog Timer Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACCATxDR</name>
          <description>Channel current application transmit descriptor register</description>
          <addressOffset>0x144</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CURTDESAPTR</name>
              <description>Application Transmit Descriptor Address Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACCARxDR</name>
          <description>Channel current application receive descriptor register</description>
          <addressOffset>0x14C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CURRDESAPTR</name>
              <description>Application Receive Descriptor Address Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACCATxBR</name>
          <description>Channel current application transmit buffer register</description>
          <addressOffset>0x154</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CURTBUFAPTR</name>
              <description>Application Transmit Buffer Address Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACCARxBR</name>
          <description>Channel current application receive buffer register</description>
          <addressOffset>0x15C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CURRBUFAPTR</name>
              <description>Application Receive Buffer Address Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACSR</name>
          <description>Channel status register</description>
          <addressOffset>0x160</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REB</name>
              <description>Rx DMA Error Bits</description>
              <bitOffset>19</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TEB</name>
              <description>Tx DMA Error Bits</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>NIS</name>
              <description>Normal Interrupt Summary</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AIS</name>
              <description>Abnormal Interrupt Summary</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CDE</name>
              <description>Context Descriptor Error</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBE</name>
              <description>Fatal Bus Error</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERI</name>
              <description>Early Receive Interrupt</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETI</name>
              <description>Early Transmit Interrupt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RWT</name>
              <description>Receive Watchdog Timeout</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RPS</name>
              <description>Receive Process Stopped</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RBU</name>
              <description>Receive Buffer Unavailable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RI</name>
              <description>Receive Interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TBU</name>
              <description>Transmit Buffer Unavailable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TPS</name>
              <description>Transmit Process Stopped</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TI</name>
              <description>Transmit Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACMFCR</name>
          <description>Channel missed frame count register</description>
          <addressOffset>0x16C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MFCO</name>
              <description>Overflow status of the MFC Counter</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MFC</name>
              <description>Dropped Packet Counters</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
