knieriem/tinygo-stm32-svd/svd/stm32h755cm7.svd
        <register derivedFrom="RST1R">
          <name>RST2R</name>
          <displayName>RSTA2R</displayName>
          <description>Timerx Output2 Reset Register</description>
          <addressOffset>0x48</addressOffset>
        </register>
        <register>
          <name>EEFR1</name>
          <displayName>EEFAR1</displayName>
          <description>Timerx External Event Filtering Register
          1</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>1-5</dimIndex>
              <name>EE%sFLTR</name>
              <description>External Event %s filter</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>EE1FLTR</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No filtering</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BlankResetToCompare1</name>
                  <description>Blanking from counter reset/roll-over to Compare 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BlankResetToCompare2</name>
                  <description>Blanking from counter reset/roll-over to Compare 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BlankResetToCompare3</name>
                  <description>Blanking from counter reset/roll-over to Compare 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BlankResetToCompare4</name>
                  <description>Blanking from counter reset/roll-over to Compare 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BlankTIMFLTR1</name>
                  <description>Blanking from another timing unit: TIMFLTR1 source</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BlankTIMFLTR2</name>
                  <description>Blanking from another timing unit: TIMFLTR2 source</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BlankTIMFLTR3</name>
                  <description>Blanking from another timing unit: TIMFLTR3 source</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BlankTIMFLTR4</name>
                  <description>Blanking from another timing unit: TIMFLTR4 source</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BlankTIMFLTR5</name>
                  <description>Blanking from another timing unit: TIMFLTR5 source</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BlankTIMFLTR6</name>
                  <description>Blanking from another timing unit: TIMFLTR6 source</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BlankTIMFLTR7</name>
                  <description>Blanking from another timing unit: TIMFLTR7 source</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BlankTIMFLTR8</name>
                  <description>Blanking from another timing unit: TIMFLTR8 source</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WindowResetToCompare2</name>
                  <description>Windowing from counter reset/roll-over to compare 2</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WindowResetToCompare3</name>
                  <description>Windowing from counter reset/roll-over to compare 3</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WindowTIMWIN</name>
                  <description>Windowing from another timing unit: TIMWIN source</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>1-5</dimIndex>
              <name>EE%sLTCH</name>
              <description>External Event %s latch</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EE1LTCH</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Event is ignored if it happens during a blank, or passed through during a window</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Event is latched and delayed till the end of the blanking or windowing period</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EEFR2</name>
          <displayName>EEFAR2</displayName>
          <description>Timerx External Event Filtering Register
          2</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>6-10</dimIndex>
              <name>EE%sFLTR</name>
              <description>External Event %s filter</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>EE6FLTR</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No filtering</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BlankResetToCompare1</name>
                  <description>Blanking from counter reset/roll-over to Compare 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BlankResetToCompare2</name>
                  <description>Blanking from counter reset/roll-over to Compare 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BlankResetToCompare3</name>
                  <description>Blanking from counter reset/roll-over to Compare 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BlankResetToCompare4</name>
                  <description>Blanking from counter reset/roll-over to Compare 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BlankTIMFLTR1</name>
                  <description>Blanking from another timing unit: TIMFLTR1 source</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BlankTIMFLTR2</name>
                  <description>Blanking from another timing unit: TIMFLTR2 source</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BlankTIMFLTR3</name>
                  <description>Blanking from another timing unit: TIMFLTR3 source</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BlankTIMFLTR4</name>
                  <description>Blanking from another timing unit: TIMFLTR4 source</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BlankTIMFLTR5</name>
                  <description>Blanking from another timing unit: TIMFLTR5 source</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BlankTIMFLTR6</name>
                  <description>Blanking from another timing unit: TIMFLTR6 source</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BlankTIMFLTR7</name>
                  <description>Blanking from another timing unit: TIMFLTR7 source</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BlankTIMFLTR8</name>
                  <description>Blanking from another timing unit: TIMFLTR8 source</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WindowResetToCompare2</name>
                  <description>Windowing from counter reset/roll-over to compare 2</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WindowResetToCompare3</name>
                  <description>Windowing from counter reset/roll-over to compare 3</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WindowTIMWIN</name>
                  <description>Windowing from another timing unit: TIMWIN source</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>6-10</dimIndex>
              <name>EE%sLTCH</name>
              <description>External Event %s latch</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EE6LTCH</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Event is ignored if it happens during a blank, or passed through during a window</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Event is latched and delayed till the end of the blanking or windowing period</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RSTR</name>
          <displayName>RSTAR</displayName>
          <description>TimerA Reset Register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TIMBCMP1</name>
              <description>Timer B Compare 1</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TIMBCMP1</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>Timer Y compare Z event has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ResetCounter</name>
                  <description>Timer X counter is reset upon timer Y compare Z event</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMECMP4</name>
              <description>Timer E Compare 4</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TIMBCMP1"/>
            </field>
            <field>
              <name>TIMECMP2</name>
              <description>Timer E Compare 2</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TIMBCMP1"/>
            </field>
            <field>
              <name>TIMECMP1</name>
              <description>Timer E Compare 1</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TIMBCMP1"/>
            </field>
            <field>
              <name>TIMDCMP4</name>
              <description>Timer D Compare 4</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TIMBCMP1"/>
            </field>
            <field>
              <name>TIMDCMP2</name>
              <description>Timer D Compare 2</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TIMBCMP1"/>
            </field>
            <field>
              <name>TIMDCMP1</name>
              <description>Timer D Compare 1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TIMBCMP1"/>
            </field>
            <field>
              <name>TIMCCMP4</name>
              <description>Timer C Compare 4</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TIMBCMP1"/>
            </field>
            <field>
              <name>TIMCCMP2</name>
              <description>Timer C Compare 2</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TIMBCMP1"/>
            </field>
            <field>
              <name>TIMCCMP1</name>
              <description>Timer C Compare 1</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TIMBCMP1"/>
            </field>
            <field>
              <name>TIMBCMP4</name>
              <description>Timer B Compare 4</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TIMBCMP1"/>
            </field>
            <field>
              <name>TIMBCMP2</name>
              <description>Timer B Compare 2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TIMBCMP1"/>
            </field>
            <field>
              <dim>10</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>1-10</dimIndex>
              <name>EXTEVNT%s</name>
              <description>External Event %s</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EXTEVNT1</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>External event Z has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ResetCounter</name>
                  <description>Timer X counter is reset upon external event Z</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>1-4</dimIndex>
              <name>MSTCMP%s</name>
              <description>Master compare %s</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MSTCMP1</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>Master timer compare Z event has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ResetCounter</name>
                  <description>Timer X counter is reset upon master timer compare Z event</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSTPER</name>
              <description>Master timer Period</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MSTPER</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>Master timer period event has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ResetCounter</name>
                  <description>Timer X counter is reset upon master timer period event</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP2</name>
              <description>Timer A compare 2 reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CMP2</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>Timer X compare Z event has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ResetCounter</name>
                  <description>Timer X counter is reset upon timer X compare Z event</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP4</name>
              <description>Timer A compare 4 reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="CMP2"/>
            </field>
            <field>
              <name>UPDT</name>
              <description>Timer A Update reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>UPDT</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>Update event has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ResetCounter</name>
                  <description>Timer X counter is reset upon update event</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHPR</name>
          <displayName>CHPAR</displayName>
          <description>Timerx Chopper Register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STRTPW</name>
              <description>STRTPW</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CARDTY</name>
              <description>Timerx chopper duty cycle
              value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CARFRQ</name>
              <description>Timerx carrier frequency
              value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
