knieriem/tinygo-stm32-svd/svd/stm32h755cm7.svd
        <register>
          <name>BMCR</name>
          <displayName>BMCR</displayName>
          <description>Burst Mode Control Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BMSTAT</name>
              <description>Burst Mode Status</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <enumeratedValues>
                <name>BMSTATR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Burst</name>
                  <description>Burst operation ongoing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>BMSTATW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Cancel</name>
                  <description>Terminate burst mode</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MTBM</name>
              <description>Master Timer Burst Mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MTBM</name>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>Counter clock is maintained and timer operates normally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Stopped</name>
                  <description>Counter clock is stopped and counter is reset</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>5</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>A,B,C,D,E</dimIndex>
              <name>T%sBM</name>
              <description>Timer %s Burst Mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MTBM"/>
            </field>
            <field>
              <name>BMPREN</name>
              <description>Burst Mode Preload Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>BMPREN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Preload disabled: the write access is directly done into active registers</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Preload enabled: the write access is done into preload registers</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BMPRSC</name>
              <description>Burst Mode Prescaler</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>BMPRSC</name>
                <enumeratedValue>
                  <name>Div1</name>
                  <description>Clock not divided</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div2</name>
                  <description>Division by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div4</name>
                  <description>Division by 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div8</name>
                  <description>Division by 8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div16</name>
                  <description>Division by 16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div32</name>
                  <description>Division by 32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div64</name>
                  <description>Division by 64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div128</name>
                  <description>Division by 128</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div256</name>
                  <description>Division by 256</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div512</name>
                  <description>Division by 512</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div1024</name>
                  <description>Division by 1024</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div2048</name>
                  <description>Division by 2048</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div4096</name>
                  <description>Division by 4096</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div8192</name>
                  <description>Division by 8192</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div16384</name>
                  <description>Division by 16384</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div32768</name>
                  <description>Division by 32768</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BMCLK</name>
              <description>Burst Mode Clock source</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>BMCLK</name>
                <enumeratedValue>
                  <name>Master</name>
                  <description>Master timer reset/roll-over</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TimerA</name>
                  <description>Timer A counter reset/roll-over</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TimerB</name>
                  <description>Timer B counter reset/roll-over</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TimerC</name>
                  <description>Timer C counter reset/roll-over</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TimerD</name>
                  <description>Timer D counter reset/roll-over</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TimerE</name>
                  <description>Timer E counter reset/roll-over</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event1</name>
                  <description>On-chip Event 1 (BMClk[1]), acting as a burst mode counter clock</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event2</name>
                  <description>On-chip Event 2 (BMClk[2]), acting as a burst mode counter clock</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event3</name>
                  <description>On-chip Event 3 (BMClk[3]), acting as a burst mode counter clock</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event4</name>
                  <description>On-chip Event 4 (BMClk[4]), acting as a burst mode counter clock</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Clock</name>
                  <description>Prescaled f_HRTIM clock (as per BMPRSC[3:0] setting</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BMOM</name>
              <description>Burst Mode operating mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>BMOM</name>
                <enumeratedValue>
                  <name>SingleShot</name>
                  <description>Single-shot mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Continuous</name>
                  <description>Continuous operation</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BME</name>
              <description>Burst Mode enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>BME</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Burst mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Burst mode enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
